ch32-riscv-ug/ArduinoCore-CH32/variants/CH32V305/pins_arduino.h
/* ---- USART pins (device-data; one route per USART, chosen for
 *      the whole series - see choose_uarts in generate.py) ---- */
/* USART1: route default, on 2 of 4 parts */
#define CH32_SERIAL1_TX PA9
#define CH32_SERIAL1_RX PA10
#define CH32_SERIAL1_HANDLER USART1_IRQHandler
#define CH32_SERIAL1_CLKEN_ADDR 0x40021018u
#define CH32_SERIAL1_CLKEN_MASK 0x00004000u
#define CH32_SERIAL1_IRQ CH32_IRQN_USART1
#define CH32_SERIAL1_REMAP_MASK 0x00000004u
#define CH32_SERIAL1_REMAP_VAL  0x00000000u
#define CH32_SERIAL1_REMAP2_MASK 0x04000000u
#define CH32_SERIAL1_REMAP2_VAL  0x00000000u
/* SERIAL1 routes for setRoute()/setPins(): route number, then TX, RX */
#define CH32_SERIAL1_ROUTE_COUNT 2
#define CH32_SERIAL1_ROUTES { \
    { 0, { PA9, PA10, CH32_ROUTE_NO_PIN }, 0x00000000u, 0x00000000u }, \
    { 1, { PB6, PB7, CH32_ROUTE_NO_PIN }, 0x00000004u, 0x00000000u }, \
}
/* USART2: route default, on 2 of 4 parts */
#define CH32_SERIAL2_TX PA2
#define CH32_SERIAL2_RX PA3
#define CH32_SERIAL2_HANDLER USART2_IRQHandler
#define CH32_SERIAL2_CLKEN_ADDR 0x4002101cu
#define CH32_SERIAL2_CLKEN_MASK 0x00020000u
#define CH32_SERIAL2_IRQ CH32_IRQN_USART2
#define CH32_SERIAL2_REMAP_MASK 0x00000008u
#define CH32_SERIAL2_REMAP_VAL  0x00000000u
/* SERIAL2 routes for setRoute()/setPins(): route number, then TX, RX */
#define CH32_SERIAL2_ROUTE_COUNT 1
#define CH32_SERIAL2_ROUTES { \
    { 0, { PA2, PA3, CH32_ROUTE_NO_PIN }, 0x00000000u, 0x00000000u }, \
}
/* USART3: route default, on every part */
#define CH32_SERIAL3_TX PB10
#define CH32_SERIAL3_RX PB11
#define CH32_SERIAL3_HANDLER USART3_IRQHandler
#define CH32_SERIAL3_CLKEN_ADDR 0x4002101cu
#define CH32_SERIAL3_CLKEN_MASK 0x00040000u
#define CH32_SERIAL3_IRQ CH32_IRQN_USART3
#define CH32_SERIAL3_REMAP_MASK 0x00000030u
#define CH32_SERIAL3_REMAP_VAL  0x00000000u
/* SERIAL3 routes for setRoute()/setPins(): route number, then TX, RX */
#define CH32_SERIAL3_ROUTE_COUNT 2
#define CH32_SERIAL3_ROUTES { \
    { 0, { PB10, PB11, CH32_ROUTE_NO_PIN }, 0x00000000u, 0x00000000u }, \
    { 1, { PC10, PC11, CH32_ROUTE_NO_PIN }, 0x00000010u, 0x00000000u }, \
}
/* USART4: route default, on 2 of 4 parts */
#define CH32_SERIAL4_TX PC10
#define CH32_SERIAL4_RX PC11
#define CH32_SERIAL4_HANDLER UART4_IRQHandler
#define CH32_SERIAL4_CLKEN_ADDR 0x4002101cu
#define CH32_SERIAL4_CLKEN_MASK 0x00080000u
#define CH32_SERIAL4_IRQ CH32_IRQN_UART4
#define CH32_SERIAL4_REMAP2_MASK 0x00030000u
#define CH32_SERIAL4_REMAP2_VAL  0x00000000u
/* SERIAL4 routes for setRoute()/setPins(): route number, then TX, RX */
#define CH32_SERIAL4_ROUTE_COUNT 2
#define CH32_SERIAL4_ROUTES { \
    { 0, { PC10, PC11, CH32_ROUTE_NO_PIN }, 0x00000000u, 0x00000000u }, \
    { 1, { PB0, PB1, CH32_ROUTE_NO_PIN }, 0x00000000u, 0x00010000u }, \
}
/* USART5: route default, on 2 of 4 parts */
#define CH32_SERIAL5_TX PC12
#define CH32_SERIAL5_RX PD2
#define CH32_SERIAL5_HANDLER UART5_IRQHandler
#define CH32_SERIAL5_CLKEN_ADDR 0x4002101cu
#define CH32_SERIAL5_CLKEN_MASK 0x00100000u
#define CH32_SERIAL5_IRQ CH32_IRQN_UART5
#define CH32_SERIAL5_REMAP2_MASK 0x000c0000u
#define CH32_SERIAL5_REMAP2_VAL  0x00000000u
/* SERIAL5 routes for setRoute()/setPins(): route number, then TX, RX */
#define CH32_SERIAL5_ROUTE_COUNT 2
#define CH32_SERIAL5_ROUTES { \
    { 0, { PC12, PD2, CH32_ROUTE_NO_PIN }, 0x00000000u, 0x00000000u }, \
    { 1, { PB4, PB5, CH32_ROUTE_NO_PIN }, 0x00000000u, 0x00040000u }, \
}
#ifndef CH32_SERIAL_DEFAULT
#define CH32_SERIAL_DEFAULT 1
#endif

/* ---- I2C pins (device-data; one route per instance,
 *      chosen for the whole series - see choose_i2cs) ---- */
/* I2C1: route default, on every part */
#define CH32_I2C1_SCL PB6
#define CH32_I2C1_SDA PB7
#define CH32_I2C1_CLKEN_ADDR 0x4002101cu
#define CH32_I2C1_CLKEN_MASK 0x00200000u
#define CH32_I2C1_REMAP_MASK 0x00000002u
#define CH32_I2C1_REMAP_VAL  0x00000000u
/* I2C1 routes for setRoute()/setPins(): route number, then SCL, SDA */
#define CH32_I2C1_ROUTE_COUNT 2
#define CH32_I2C1_ROUTES { \
    { 0, { PB6, PB7, CH32_ROUTE_NO_PIN }, 0x00000000u, 0x00000000u }, \
    { 1, { PB8, PB9, CH32_ROUTE_NO_PIN }, 0x00000002u, 0x00000000u }, \
}
/* I2C2: route default, on every part */
#define CH32_I2C2_SCL PB10
#define CH32_I2C2_SDA PB11
#define CH32_I2C2_CLKEN_ADDR 0x4002101cu
#define CH32_I2C2_CLKEN_MASK 0x00400000u
/* Arduino's standard names for the first bus (Wire). */
#ifndef PIN_WIRE_SCL
#define PIN_WIRE_SCL CH32_I2C1_SCL
#define PIN_WIRE_SDA CH32_I2C1_SDA
#define SCL PIN_WIRE_SCL
#define SDA PIN_WIRE_SDA
#endif

/* ---- SPI pins (device-data; one route per instance,
 *      chosen for the whole series - see choose_spis).
 *      NSS is not listed: Arduino drives chip select as a GPIO. ---- */
/* SPI1: route default, on 3 of 4 parts */
#define CH32_SPI1_SCK PA5
#define CH32_SPI1_MISO PA6
#define CH32_SPI1_MOSI PA7
#define CH32_SPI1_CLKEN_ADDR 0x40021018u
#define CH32_SPI1_CLKEN_MASK 0x00001000u
#define CH32_SPI1_REMAP_MASK 0x00000001u
#define CH32_SPI1_REMAP_VAL  0x00000000u
/* SPI1 routes for setRoute()/setPins(): route number, then SCK, MISO, MOSI */
#define CH32_SPI1_ROUTE_COUNT 2
#define CH32_SPI1_ROUTES { \
    { 0, { PA5, PA6, PA7 }, 0x00000000u, 0x00000000u }, \
    { 1, { PB3, PB4, PB5 }, 0x00000001u, 0x00000000u }, \
}
/* SPI2: route default, on every part */
#define CH32_SPI2_SCK PB13
#define CH32_SPI2_MISO PB14
#define CH32_SPI2_MOSI PB15
#define CH32_SPI2_CLKEN_ADDR 0x4002101cu
#define CH32_SPI2_CLKEN_MASK 0x00004000u
/* SPI3: route default, on 2 of 4 parts */
#define CH32_SPI3_SCK PB3
#define CH32_SPI3_MISO PB4
#define CH32_SPI3_MOSI PB5
#define CH32_SPI3_CLKEN_ADDR 0x4002101cu
#define CH32_SPI3_CLKEN_MASK 0x00008000u
/* device-data lists PA15, PB5 for MOSI on this route;
 * the selection rule picked the one above (never a debug
 * or strap pad, prefer a pad on every part, else table
 * order - see resolve_pin_candidates). */
#define CH32_SPI3_REMAP_MASK 0x10000000u
#define CH32_SPI3_REMAP_VAL  0x00000000u
/* SPI3 routes for setRoute()/setPins(): route number, then SCK, MISO, MOSI */
#define CH32_SPI3_ROUTE_COUNT 2
#define CH32_SPI3_ROUTES { \
    { 0, { PB3, PB4, PB5 }, 0x00000000u, 0x00000000u }, \
    { 1, { PC10, PC11, PC12 }, 0x10000000u, 0x00000000u }, \
}
/* Arduino's standard names for the first bus (SPI). */
#ifndef PIN_SPI_SCK
#define PIN_SPI_SCK CH32_SPI1_SCK
#define PIN_SPI_MISO CH32_SPI1_MISO
#define PIN_SPI_MOSI CH32_SPI1_MOSI
#define SCK PIN_SPI_SCK
#define MISO PIN_SPI_MISO
#define MOSI PIN_SPI_MOSI
#define PIN_SPI_SS PA4
#define SS PIN_SPI_SS
#endif

